Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart
The DocumentInfo stored in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.AddCopy(Autodesk.Navisworks.Api.GroupItem,Autodesk.Navisworks.Api.SavedItem)
Adds a copy of item to the end of the specified parent group contained by DocumentInfo.
parent:
The parent group to add to. RootItem or null to add directly to Value
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by DocumentInfo
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.AddCopy(Autodesk.Navisworks.Api.SavedItem)
Adds a copy of item to the end of Value.
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.AddUniqueCopy(Autodesk.Navisworks.Api.SavedItem,System.String)
Adds an unique copy of item to the end of Value
sourceFileName:
If the parent group have the same name, will add it to item name
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Changed
Occurs when the DocumentInfo contained in this object has changed

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Changing
Occurs when the DocumentInfo contained in this object is about to change

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.CreateCopy
Creates a copy of Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.EditDisplayName(Autodesk.Navisworks.Api.SavedItem,System.String)
Edit item and update it's DisplayName
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentException:
Argument 'item' is not contained by DocumentInfo

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.InsertCopy(Autodesk.Navisworks.Api.GroupItem,System.Int32,Autodesk.Navisworks.Api.SavedItem)
Inserts a copy of item into the specified parent group contained by DocumentInfo.
parent:
The parent group to insert into. RootItem or null to insert directly into Value
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by DocumentInfo
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.InsertCopy(System.Int32,Autodesk.Navisworks.Api.SavedItem)
Inserts a copy of item into Value.
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.InsertUniqueCopy(Autodesk.Navisworks.Api.GroupItem,System.Int32,Autodesk.Navisworks.Api.SavedItem,System.String)
Inserts a copy of item into the specified parent group contained by DocumentInfo. If have same sheet, will reset id and rename
parent:
The parent group to insert into. RootItem or null to insert directly into Value
sourceFileName:
If the parent group have the same name, will add it to item name
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by DocumentInfo
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Move(Autodesk.Navisworks.Api.GroupItem,System.Int32,Autodesk.Navisworks.Api.GroupItem,System.Int32)
Moves item at oldIndex in OldParent to newIndex in newParent
oldParent:
The parent group to move the item from.
newParent:
The parent group to move to.
If newParent is equal to oldParent, the item will be moved within the same SavedItemCollection.
Throws System.ArgumentException:
Argument 'oldParent' has been Disposed
Throws System.ArgumentException:
Argument 'oldParent' is not contained by DocumentInfo
Throws System.ArgumentException:
Argument 'newParent' has been Disposed
Throws System.ArgumentException:
Argument 'newParent' is not contained by DocumentInfo
Throws System.ArgumentOutOfRangeException:
Argument 'oldIndex' out of range
Throws System.ArgumentOutOfRangeException:
Argument 'newIndex' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Move(System.Int32,System.Int32)
Move sheet from oldIndex to new position in collection.
oldIndex: The sheet in this position to move
newIndex: The moved sheet place in this position
Throws System.ArgumentException:
Two arguments 'oldIndex' and 'newIndex are equal, they should not be equal.
Throws System.ArgumentOutOfRangeException:
Argument 'oldIndex' out of range
Throws System.ArgumentOutOfRangeException:
Argument 'newIndex' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.op_Implicit(Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart)~Autodesk.Navisworks.Api.DocumentInfo
Conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Remove(Autodesk.Navisworks.Api.GroupItem,Autodesk.Navisworks.Api.SavedItem)
Removes specified item from the specified parent group contained by DocumentInfo.
parent:
The parent group to remove from. null to remove directly from DocumentInfo
Returns:
false if item not found in DocumentInfo
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by DocumentInfo
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Remove(Autodesk.Navisworks.Api.SavedItem)
Removes specified item from DocumentInfo.
Returns:
false if item not found in DocumentInfo
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.RemoveAt(Autodesk.Navisworks.Api.GroupItem,System.Int32)
Removes item from the specified parent group contained by DocumentInfo.
parent:
The parent group to remove from. RootItem or null to remove directly from DocumentInfo
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by DocumentInfo
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.RemoveAt(System.Int32)
Removes item at the specified index from DocumentInfo.
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.ReplaceWithCopy(Autodesk.Navisworks.Api.GroupItem,System.Int32,Autodesk.Navisworks.Api.SavedItem)
Replaces item from the specified parent group with a copy of item
parent:
The parent group to insert into. RootItem or null to insert directly into Value
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by DocumentInfo
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.ReplaceWithCopy(System.Int32,Autodesk.Navisworks.Api.SavedItem)
Replaces item at given index within DocumentInfo with a copy of item
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.ToDocumentInfo
Explicit form of conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentInfoPart.Value
The value of the current DocumentInfo within the document